<?php return [
  'welcome' => 'مرحبا',
  'profile' => 'الملف الشخصي',
  'two_factor_authentication' => 'المصادقة الثنائية',
  'two_factor_authentication_description' =>
    'أضف أمانًا إضافيًا إلى حسابك باستخدام المصادقة الثنائية.',
  'enabled' => 'لقد قمت بتمكين المصادقة الثنائية.',
  'not_enabled' => 'لم تقم بتمكين المصادقة الثنائية.',
  'finish_enabling' => 'أكمل تمكين المصادقة الثنائية.',
  'secure_random_token' =>
    'عند تمكين المصادقة الثنائية، سيُطلب منك رمز عشوائي آمن أثناء المصادقة. يمكنك استرداد هذا الرمز من تطبيق Google Authenticator على هاتفك.',
  'qr_code_instructions' =>
    'لإكمال تمكين المصادقة الثنائية، امسح رمز الاستجابة السريعة التالي باستخدام تطبيق المصادقة على هاتفك أو أدخل مفتاح الإعداد وقدم رمز OTP الذي تم إنشاؤه.',
  'enabled_qr_code_instructions' =>
    'تم الآن تمكين المصادقة الثنائية. امسح رمز الاستجابة السريعة التالي باستخدام تطبيق المصادقة على هاتفك أو أدخل مفتاح الإعداد.',
  'setup_key' => 'مفتاح الإعداد: ',
  'recovery_codes_instructions' =>
    'احفظ رموز الاسترداد هذه في مدير كلمات مرور آمن. يمكن استخدامها لاستعادة الوصول إلى حسابك إذا فقدت جهاز المصادقة الثنائية الخاص بك.',
  'enable' => 'تمكين',
  'confirm' => 'تأكيد',
  'regenerate_recovery_codes' => 'إعادة إنشاء رموز الاسترداد',
  'show_recovery_codes' => 'عرض رموز الاسترداد',
  'cancel' => 'إلغاء',
  'disable' => 'تعطيل',
  'profile_update' => 'تحديث الملف الشخصي',
  'profile_update_description' =>
    'قم بتحديث معلومات الملف الشخصي وعنوان البريد الإلكتروني لحسابك.',
  'password_update' => 'تحديث كلمة المرور',
  'password_update_description' =>
    'تأكد من أن حسابك يستخدم كلمة مرور طويلة وعشوائية للبقاء آمنًا.',
  'profile_information' => 'معلومات الملف الشخصي',
  'profile_information_description' =>
    'قم بتحديث معلومات الملف الشخصي وعنوان البريد الإلكتروني لحسابك.',
  'update_password' => 'تحديث كلمة المرور',
  'update_password_description' =>
    'تأكد من أن حسابك يستخدم كلمة مرور طويلة وعشوائية للبقاء آمنًا.',
  'browser_sessions' => 'جلسات المتصفح',
  'browser_sessions_description' =>
    'إدارة وتسجيل الخروج من الجلسات النشطة على المتصفحات والأجهزة الأخرى.',
  'delete_account' => 'حذف الحساب',
  'delete_account_description' => 'احذف حسابك بشكل دائم.',
  'current_password' => 'كلمة المرور الحالية',
  'new_password' => 'كلمة المرور الجديدة',
  'confirm_password' => 'تأكيد كلمة المرور',
  'log_out_other_browser_sessions' => 'تسجيل الخروج من جلسات المتصفح الأخرى',
  'log_out_other_browser_sessions_description' =>
    'يرجى إدخال كلمة المرور الخاصة بك لتأكيد أنك ترغب في تسجيل الخروج من جلسات المتصفح الأخرى عبر جميع أجهزتك.',
  'delete_account_confirmation' =>
    'هل أنت متأكد أنك تريد حذف حسابك؟ بمجرد حذف حسابك، سيتم حذف جميع موارده وبياناته بشكل دائم. يرجى إدخال كلمة المرور الخاصة بك لتأكيد أنك ترغب في حذف حسابك بشكل دائم.',
  'please_confirm_your_password' => 'لأمانك، يرجى تأكيد كلمة المرور الخاصة بك للمتابعة.',
  'done' => 'تم.',
  'save' => 'حفظ.',
  'saved' => 'تم الحفظ.',
];
